import pytest


@pytest.fixture
def my_list_masks_test():
    return [
    "1596837868705199",
    "64686473678894779589",
    "7158300734726758",
    "35383033474447895560",
    "6831982476737658",
    "8990922113665229",
    "5999414228426353",
    "73654108430135874305",
            ]


@pytest.fixture
def result_list_card_number():
    return [
    "1596 83** **** 5199",
    "Введен некоректный номер карты",
    "7158 30** **** 6758",
    "Введен некоректный номер карты",
    "6831 98** **** 7658",
    "8990 92** **** 5229",
    "5999 41** **** 6353",
    "Введен некоректный номер карты",
            ]

@pytest.fixture
def result_list_account_number():
    return [
    "Введен некоректный номер счета",
    "**9589",
    "Введен некоректный номер счета",
    "**5560",
    "Введен некоректный номер счета",
    "Введен некоректный номер счета",
    "Введен некоректный номер счета",
    "**4305",
            ]
